docs/Topics/ML/superposition_toy_models/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 21:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Readme</title>
<meta name="author" content="Elle Najt" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Readme</h1>
<div id="outline-container-org684cfdd" class="outline-2">
<h2 id="org684cfdd">Reproductions of toy models</h2>
<div class="outline-text-2" id="text-org684cfdd">
<p>
Did some reproductions of the basic example from the toy models paper.<br />
</p>

<div class="org-src-container">
<pre class="src src-bash">streamlit run toy_models_reproductions.py
</pre>
</div>
</div>
</div>
<div id="outline-container-org43dcc94" class="outline-2">
<h2 id="org43dcc94">Oversampled vector</h2>
<div class="outline-text-2" id="text-org43dcc94">
<ul class="org-ul">
<li>Sample from a gaussian<br /></li>
<li>Choose on of the points at random, and over sample it<br /></li>
<li>Does a SAE learn to assign a neuron to that point<br /></li>
</ul>
<p>
Yes, usually. Explore with this app:<br />
</p>

<div class="org-src-container">
<pre class="src src-bash">streamlit run oversampling_streamlit_app.py
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elle Najt</p>
<p class="email">Email: <a href="mailto:LNAJT4@gmail.com">LNAJT4@gmail.com</a></p>
<p class="date">Created: 2026-02-21 Sat 21:09</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
